Repository: tsinis/colors_ai
Catalog: lib/l10n/app_*.arb
Languages: cs, ru, sk

# aboutGenerator
source: Color scheme generator that uses deep learning from
cs: Generátor barevných schémat, který využívá hlubokého učení od
ru: Генератор цветовых схем, использующий глубокое обучение
sk: Generátor farebných schém, ktorý využíva hlbokého učenie od

# aboutSourceCode
source: The source code of this application is available at
cs: Zdrojový kód této aplikace je dostupný v
ru: Исходный код этого приложения доступен
sk: Zdrojový kód tejto aplikácie je dostupný v

# aboutSourceRepository
source: this GitHub repository
cs: tomto repozitáři GitHub
ru: в этом репозитории GitHub
sk: tomto repozitári GitHub

# aboutAttribution
source: Attribution
cs: Uvádění původu
ru: Указание авторства
sk: Uvádzanie pôvodu

# aboutSounds
source: UI sounds used in this application:
cs: Zvuky UI použité v této aplikaci:
ru: Звуки пользовательского интерфейса, используемые в этом приложении:
sk: Zvuky UI použité v tejto aplikácii:

# aboutByGoogle
source: by
cs: od
ru: от
sk: od

# aboutSoundsLicense
source: are licensed under
cs: jsou licencováni jako
ru: лицензированы под
sk: sú licencovaní ako

# aboutThisAppTooltip
source: About this app
cs: O této aplikaci
ru: Об этом приложении
sk: O tejto aplikácii

# noConnectionTitle
source: Oh no!
cs: Ale ne!
ru: О нет!
sk: Ale nie!

# noConnectionDescription
source: Unable to connect to AI server.
cs: Nelze se připojit k serveru AI.
ru: Невозможно подключиться к серверу.
sk: Nedá sa pripojiť k serveru AI.

# returnButtonLabel
source: Return
cs: Vrátit se
ru: Вернуться
sk: Vrátiť sa

# noFavoritesTitle
source: Oops!
cs: Jejda!
ru: Ой!
sk: Och!

# noFavoritesDescription
source: Favorite Palettes list is empty now.
cs: Seznam oblíbených palet je nyní prázdný.
ru: Список любимых палитр теперь пуст.
sk: Zoznam obľúbených paliet je teraz prázdny.

# addFavoritesButtonLabel
source: Add some
cs: Přidejte
ru: Добавить
sk: Pridajte

# removeAllTitle
source: Remove all favorite palettes
cs: Odstranit všechny oblíbené palety
ru: Удалить все любимые палитры
sk: Odstrániť všetky obľúbené palety

# removeButtonLabel
source: Remove
cs: Odstranit
ru: Удалить
sk: Odstrániť

# urlCopiedMessage
source: Link copied!
cs: Odkaz zkopírován!
ru: Ссылка скопирована!
sk: Odkaz skopírovaný!

# urlOpenButtonLabel
source: Open
cs: Otevřít
ru: Открыть
sk: Otvoriť

# colorCopiedMessage
source: Color {colorHexValue} copied!
cs: Barva {colorHexValue} zkopírována!
ru: Цвет {colorHexValue} скопирован!
sk: Farba {colorHexValue} skopírovaná!

# serverMaintenanceMessage
source: The server is updated at midnight PDT, so it may be unavailable for 30 sec.
cs: Server je aktualizován o půlnoci PDT, takže může být chvílku nedostupný
ru: Сервер обновляется в полночь PDT, поэтому он может быть недоступен в течение 30 сек.

# shareFailedMessage
source: Failed to share, try another type.
cs: Sdílení se nezdařilo, zkuste jiný typ.
ru: Не удалось поделиться, попробуйте другой тип
sk: Zdieľanie zlyhalo, skúste iný typ.

# removeFavoritesTip
source: Tap on the row to restore colors. Swipe right/left to remove them.
cs: Klepnutím barvy obnovíte. Přejetím barvy odstraníte
ru: Нажмите на цвета, для восстановления. Проведите пальцем чтобы удалить их.
sk: Kliknutím farby obnovíte. Přejetím farby odstránite

# pullToRefreshTip
source: Pull down to refresh
cs: Táhnete dolů pro generování
ru: Потяните вниз, чтобы обновить
sk: Ťaháte dole pre generovanie

# onboardingLockTip
source: Double tap anywhere to lock the color
cs: Dvojitým klepnutím kdekoli zamknete barvu
ru: Дважды нажмите в любом месте, чтобы заблокировать цвет
sk: Dvojitým kliknutím kdekoľvek zamknete farbu

# onboardingSelectTip
source: Tap on the left part to select a color
cs: Klepněte na levou část pro výběr barvy
ru: Нажмите на левую часть, чтобы выбрать цвет
sk: Kliknite na ľavú časť pre výber farby

# onboardingMoveTip
source: The position of the colors does matter, hold & drag to reorder them
cs: Pozice barev jsou důležité podržte a táhněte pro přeuspořádání
ru: Положение цветов имеет значение, удерживайте и перетаскивайте, чтобы изменить их порядок
sk: Pozície farieb sú dôležité podržte a ťahajte pre preusporiadanie

# onboardingGenerateTip
source: Pull down to generate new colors
cs: Táhnete dolů pro generování nových barev
ru: Потяните вниз, чтобы создать новые цвета
sk: Ťaháte dole pre generovanie nových farieb

# onboardingSaveTip
source: Tap the button below to save your colors
cs: Klepnutím na tlačítko níže uložte barvy
ru: Нажмите кнопку ниже, чтобы сохранить цвета
sk: Kliknutím na tlačidlo nižšie uložte farby

# onboardingDoneButtonLabel
source: Got it!
cs: Chápu
ru: Ясно
sk: Chápem

# shareTabLabel
source: Share Palette
cs: Sdílet paletu
ru: Поделиться палитрой
sk: Zdieľať paletu

# generateTabLabel
source: Generate Palette
cs: Generovat paletu
ru: Создать палитру
sk: Generovať paletu

# noFavoritesTabLabel
source: No Favorite Palettes
cs: Žádné oblíbené palety
ru: Нет любимых палитр
sk: Žiadne obľúbené palety

# favoritesTabLabel
source: Favorite Palettes
cs: Oblíbené palety
ru: Любимые палитры
sk: Obľúbené palety

# shareLinksLabel
source: Share a link via:
cs: Sdílet odkaz přes:
ru: Поделиться ссылкой через:
sk: Zdieľať odkaz cez:

# googleArtsExport
source: Arts that match your colors
cs: Umění, které ladí s vašimi barvami
ru: Искусства, соответствующие вашим цветам
sk: Umenie, ktoré ladia s vašimi farbami

source: Export to:
cs: Export do:
ru: Экспорт в:
sk: Export do:

# copyUrlButtonLabel
source: Copy URL
cs: Kopírovat URL
ru: Копировать URL
sk: Kopírovať URL

# shareUrlButtonLabel
source: Share URL
cs: Sdílet URL
ru: Поделиться URL
sk: Zdieľať URL

# a4DimensionsTitle
source: 210 by 297 millimeters
cs: 210 x 297 milimetrů
ru: 210 на 297 миллиметров
sk: 210 x 297 milimetrov

# a4DimensionsSubtitle
source: International ISO 216 Standard
cs: Mezinárodní norma ISO 216
ru: Международный стандарт ISO 216
sk: Medzinárodná norma ISO 216

# letterLabel
source: US Letter
cs: Letter
ru: Letter
sk: Letter

# letterDimensionsTitle
source: 8.5 by 11 inches
cs: 8,5 x 11 palců
ru: 8,5 на 11 дюймов
sk: 8,5 x 11 palcov

# letterDimensionsSubtitle
source: North American ANSI Standard
cs: Severoamerický standard ANSI
ru: Североамериканский стандарт ANSI
sk: Severoamerický štandard ANSI

# sharePngButtonLabel
source: Share PNG
cs: Sdílet PNG
ru: Поделиться PNG
sk: Zdieľať PNG

# sharePdfButtonLabel
source: Share PDF
cs: Sdílet PDF
ru: Поделиться PDF
sk: Zdieľať PDF

source: Unlock all colors
cs: Odemknout všechny barvy
ru: Разблокировать все цвета
sk: Odomknúť všetky farby

# savePaletteToFavorites
source: Save this palette to favorites
cs: Uložit paletu do oblíbených
ru: Сохранить эту палитру в избранном
sk: Uložiť paletu do obľúbených

# favoritePaletteSematic
source: Favorite color palette number: {paletteIndex}
cs: Číslo oblíbené palety: {paletteIndex}
ru: Номер палитры любимых цветов: {paletteIndex}
sk: Číslo obľúbené palety: {paletteIndex}

# removeSomeTitle
source: {count, plural, =1{Remove palette} one{Remove {count} palette} other{Remove {count} palettes}}
cs: {count, plural, =1{Odebrat paletu} one{Odebrat {count} paletu} few{Odebrat {count} palety} other{Odebrat {count} palet}}
ru: {count, plural, =1{Удалить палитру} one{Удалить {count} палитру} two{Удалить {count} палитры} few{Удалить {count} палитры} many{Удалить {count} палитр} other{Удалить {count} палитры}}
sk: {count, plural, =1{Odobrať paletu} one{Odobrať {count} paletu} few{Odobrať {count} palety} other{Odobrať {count} palet}}

source: Add to Favorites
cs: Přidat k oblíbeným
ru: Добавить в избранное
sk: Pridať k obľúbeným

# removeFavoritesTipLandscape
source: Press on the palette to restore colors. Press on the text label to copy HEX value
cs: Stisknutím palety obnovíte barvy. Stisknutím textového štítku zkopírujete hodnotu HEX
ru: Нажмите на палитру, чтобы восстановить цвета. Нажмите на текстовую метку, чтобы скопировать HEX-значение
sk: Stlačením palety obnovíte farby. Stisknutím textového štítku skopírujete hodnotu HEX

# removeFavoritesTooltip
source: Remove this palette
cs: Odstranit tuto paletu
ru: Удалить эту палитру
sk: Odstrániť túto paletu

# selectToRemoveFavoritesTooltip
source: Select this palette to remove
cs: Vyberte tuto paletu k odstranění
ru: Выберите эту палитру для удаления
sk: Vyberte túto paletu na odstránenie

# onboardingGenerateTipLandscape
source: Press Spacebar on keyboard to generate new colors
cs: Stisknutím mezerníku na klávesnici vytvoříte nové barvy
ru: Нажмите пробел на клавиатуре для генерации новых цветов
sk: Stlačením medzerníka na klávesnici vytvoríte nové farby

# onboardingSelectTipLandscape
source: Press anywhere (outside the lock zone) to select a color
cs: Pro výběr barvy klikněte kamkoli (mimo zamykací zónu)
ru: Нажмите на любую область (вне зоны блокировки), чтобы выбрать цвет
sk: Pre výber farby kliknite kamkoľvek (mimo blokovací zónu)

# onboardingSaveTipLandscape
source: Press the button at the top left of the screen to save colors
cs: Pro uložení barev stiskněte tlačítko v levém horním rohu obrazovky
ru: Нажмите кнопку в левом верхнем углу экрана, чтобы сохранить цвета
sk: Pre uloženie farieb stlačte tlačidlo v ľavom hornom rohu obrazovky

# shareFile
source: Share file as:
cs: Sdílet soubor jako:
ru: Поделиться файлом как:
sk: Zdieľať súbor ako:

# copyAsFormat
source: Copy {fileFormat}
cs: Kopírovat {fileFormat}
ru: Копировать {fileFormat}
sk: Kopírovať {fileFormat}

# shareAsFormat
source: Share {fileFormat}
cs: Sdílet {fileFormat}
ru: Поделиться {fileFormat}
sk: Zdieľať {fileFormat}

source: Settings
cs: Nastavení
ru: Настройки
sk: Nastavenia

source: Help
cs: Pomoc
ru: Помощь
sk: Pomoc

# colorsForUiTitle
source: Colors for UI
cs: Barvy pro UI
ru: Цвета для интерфейса
sk: Farby pre UI

# colorsForUiSubtitle
source: Improve color generation for UI design
cs: Vylepšete generování barev pro UI design
ru: Улучшение генерации цветов для UI дизайна
sk: Vylepšite generovanie farieb pre UI design

source: Appearance:
cs: Vzhled:
ru: Внешний вид
sk: Vzhľad:

# lightThemeTitle
source: Light
cs: Světlý
ru: Светлый
sk: Svetlý

# lightThemeSubtitle
source: Neutral grey, non-contrast UI for light designs
cs: Neutrální šedá, nekontrastní UI pro světlé návrhy
ru: Нейтрально-серый, неконтрастный интерфейс
sk: Neutrálne šedá, nekontrastné UI pre svetlé návrhy

# darkThemeTitle
source: Dark
cs: Tmavý
ru: Тёмный
sk: Tmavý

# darkThemeSubtitle
source: Pitch grey UI, perfect for dark themed designs
cs: Sytě šedé UI, perfektní pro tmavé návrhy
ru: Насыщенно-серый пользовательский интерфейс
sk: Sýto šedé UI, perfektné pre tmavé návrhy

# systemThemeTitle
source: System
cs: Systémové
ru: Системный
sk: Systémové

# systemThemeSubtitle
source: Use device theme brightness
cs: Použít jas motivu zařízení
ru: Использует яркость темы устройства
sk: Použiť jas motívu zariadenia

# resetButtonLabel
source: Reset
cs: Resetovat
ru: Сброс
sk: Resetovať

# formatCopied
source: {fileFormat} content copied!
cs: Obsah {fileFormat} zkopírován!
ru: Содержимое {fileFormat} файла скопировано!
sk: Obsah {fileFormat} skopírovaný!

# invalidHexErrorLabel
source: Invalid Hex code pasted
cs: Vložen neplatný HEX kód
ru: Вставлен неверный HEX код
sk: Vložený neplatný HEX kód

# hexHintTextLabel
source: Hex color code
cs: HEX kód barvy
ru: HEX код цвета
sk: HEX kód farby

source: and
cs: a
ru: и
sk: a

# selectAiProvider
source: Select AI colors provider:
cs: Vyberte poskytovatele barev AI:
ru: Выберите поставщика цветов AI:
sk: Vyberte poskytovateľa farieb AI:

# colormindApiDescription
source: Older, heavily used, has network issues
cs: Starší, má problémy s konektivitou
ru: Старый, имеет проблемы с соединением
sk: Starší, má problémy s konektivitou

# huemintApiDescription
source: Brand new, less known so less popular
cs: Zbrusu nový, méně známý/populární
ru: Новый, менее известный/популярный
sk: Zbrusu nový, menej známy/populárny

# adjacency
source: Adjacency (contrast between colors)
cs: Přilehlost (kontrast mezi barvami)
ru: Смежность (контраст между цветами)
sk: Priľahlosť (kontrast medzi farbami)

# temperature
source: Creativity (sampling temperature)
cs: Kreativita (teplota vzorkování)
ru: Креативность (температура выборки)
sk: Kreativita (teplota vzorkovania)

# vibrationsTitle
source: Vibrations
cs: Vibrace

# vibrationsLabel
source: Enable or disable haptic feedback
cs: Povolení nebo zakázání haptické odezvy
